# Data Manipulation Language - DML

**Carregando ambiente**

In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:postgres@localhost:5432/banco

In [3]:
%sql set search_path to tmp;

 * postgresql://postgres:***@localhost:5432/banco
Done.

[]

- Consultando alunos

In [9]:
%%sql 
alter table uf rename to estado;
select * from estado;

 * postgresql://postgres:***@localhost:5432/banco
Done.
0 rows affected.

[]

- Inserindo estados

In [12]:
%%sql
insert into estado (uf) values 
    ('SP'), ('RJ'), ('MT'), ('PR'), ('PA'), ('AM'), 
    ('RS'), ('CE'), ('BA'), ('TO'), ('DF'), ('AC'), 
    ('MA'), ('SE'), ('RN'), ('MG'), ('ES');

 * postgresql://postgres:***@localhost:5432/banco
17 rows affected.

[]

In [13]:
%sql select * from estado;

 * postgresql://postgres:***@localhost:5432/banco
17 rows affected.

[(1, 'SP'),
 (2, 'RJ'),
 (3, 'MT'),
 (4, 'PR'),
 (5, 'PA'),
 (6, 'AM'),
 (7, 'RS'),
 (8, 'CE'),
 (9, 'BA'),
 (10, 'TO'),
 (11, 'DF'),
 (12, 'AC'),
 (13, 'MA'),
 (14, 'SE'),
 (15, 'RN'),
 (16, 'MG'),
 (17, 'ES')]

In [16]:
%%sql 
-- inserindo indivualmente
insert into estado (uf) values ('GO');
select * from estado;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.
19 rows affected.

[(1, 'SP'),
 (2, 'RJ'),
 (3, 'MT'),
 (4, 'PR'),
 (5, 'PA'),
 (6, 'AM'),
 (7, 'RS'),
 (8, 'CE'),
 (9, 'BA'),
 (10, 'TO'),
 (11, 'DF'),
 (12, 'AC'),
 (13, 'MA'),
 (14, 'SE'),
 (15, 'RN'),
 (16, 'MG'),
 (17, 'ES'),
 (18, 'AP'),
 (19, 'GO')]

- Atualizando dados com update

In [ ]:
%%sql
-- inserindo um valor errado de forma intencional
insert into estado (uf) values ('PF');

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[]

In [18]:
%%sql
-- corrigindo o valor inserido
update estado set uf = 'PE' where uf = 'PF';

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[]

In [19]:
%sql select * from estado;

 * postgresql://postgres:***@localhost:5432/banco
20 rows affected.

[(1, 'SP'),
 (2, 'RJ'),
 (3, 'MT'),
 (4, 'PR'),
 (5, 'PA'),
 (6, 'AM'),
 (7, 'RS'),
 (8, 'CE'),
 (9, 'BA'),
 (10, 'TO'),
 (11, 'DF'),
 (12, 'AC'),
 (13, 'MA'),
 (14, 'SE'),
 (15, 'RN'),
 (16, 'MG'),
 (17, 'ES'),
 (18, 'AP'),
 (19, 'GO'),
 (20, 'PE')]

- Excluindo registros

In [20]:
%%sql 
delete from estado where id > 10;
select * from estado;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.
10 rows affected.

[(1, 'SP'),
 (2, 'RJ'),
 (3, 'MT'),
 (4, 'PR'),
 (5, 'PA'),
 (6, 'AM'),
 (7, 'RS'),
 (8, 'CE'),
 (9, 'BA'),
 (10, 'TO')]

- Retornando com select

In [21]:
%%sql 
-- utilizando where
select * from estado where id > 5;

 * postgresql://postgres:***@localhost:5432/banco
5 rows affected.

[(6, 'AM'), (7, 'RS'), (8, 'CE'), (9, 'BA'), (10, 'TO')]

In [22]:
%%sql
-- utilizando order by
select * from estado order by 2;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[(6, 'AM'),
 (9, 'BA'),
 (8, 'CE'),
 (3, 'MT'),
 (5, 'PA'),
 (4, 'PR'),
 (2, 'RJ'),
 (7, 'RS'),
 (1, 'SP'),
 (10, 'TO')]

In [23]:
%%sql
-- insert em categorias
INSERT INTO categorias (nome) VALUES
('Tecnologia'),
('Alimentos e Bebidas'),
('Moda e Vestuário'),
('Saúde e Bem-Estar'),
('Educação'),
('Esportes e Lazer'),
('Serviços Financeiros'),
('Automotivo'),
('Casa e Decoração'),
('Turismo e Viagens');

-- insert em produtos
INSERT INTO produtos (nome, descricao, preco, id_categoria) VALUES
('Notebook Ultrafino', 'Notebook leve com 16GB RAM e SSD 512GB', 4399.90, 1),
('Smartphone X20', 'Smartphone com câmera tripla e 128GB de memória', 2999.00, 1),
('Camiseta Estampada', 'Camiseta de algodão com estampa moderna', 59.90, 3),
('Suplemento Whey Protein', 'Proteína concentrada para ganho de massa muscular', 149.99, 4),
('Curso de Python', 'Curso online para aprender programação em Python', 199.00, 5),
('Bola de Futebol', 'Bola oficial tamanho 5 para partidas profissionais', 129.90, 6),
('Conta Digital Plus', 'Conta digital com cartão e TEDs ilimitadas', 0.00, 7),
('Óleo de Motor Sintético', 'Lubrificante sintético para alta performance', 89.90, 8),
('Kit de Facas Inox', 'Conjunto com 6 facas de cozinha em inox', 119.90, 9),
('Pacote de Viagem - Nordeste', '7 dias com hospedagem e café da manhã incluso', 3499.00, 10),
('Smart TV 55"', 'Smart TV 4K com comando de voz e apps integrados', 2799.00, 1),
('Tênis Esportivo', 'Tênis para corrida com amortecimento em gel', 349.90, 6),
('Curso de Inglês Online', 'Aulas interativas e certificado incluído', 149.00, 5),
('Serviço de Consultoria Financeira', 'Análise completa de finanças pessoais', 299.90, 7),
('Mesa de Jantar 6 Lugares', 'Mesa em MDF com acabamento premium', 1899.00, 9),
('Vestido Longo Floral', 'Vestido leve e ideal para o verão', 179.90, 3),
('Notebook Gamer Pro', 'Máquina poderosa com RTX 4060 e 32GB RAM', 7999.00, 1),
('Pacote de Viagem - Europa', 'Passagem + hospedagem em 3 países por 10 dias', 8999.00, 10),
('Jaqueta Corta-Vento', 'Ideal para dias frios e chuvosos', 249.90, 3),
('Curso de Marketing Digital', 'Aprenda estratégias de tráfego e SEO', 299.00, 5);

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.
20 rows affected.

[]

In [25]:
%%sql 
-- select em produtos
select * from produtos;

 * postgresql://postgres:***@localhost:5432/banco
20 rows affected.

[(1, 'Notebook Ultrafino', 'Notebook leve com 16GB RAM e SSD 512GB', 4399.9, 1),
 (2, 'Smartphone X20', 'Smartphone com câmera tripla e 128GB de memória', 2999.0, 1),
 (3, 'Camiseta Estampada', 'Camiseta de algodão com estampa moderna', 59.9, 3),
 (4, 'Suplemento Whey Protein', 'Proteína concentrada para ganho de massa muscular', 149.99, 4),
 (5, 'Curso de Python', 'Curso online para aprender programação em Python', 199.0, 5),
 (6, 'Bola de Futebol', 'Bola oficial tamanho 5 para partidas profissionais', 129.9, 6),
 (7, 'Conta Digital Plus', 'Conta digital com cartão e TEDs ilimitadas', 0.0, 7),
 (8, 'Óleo de Motor Sintético', 'Lubrificante sintético para alta performance', 89.9, 8),
 (9, 'Kit de Facas Inox', 'Conjunto com 6 facas de cozinha em inox', 119.9, 9),
 (10, 'Pacote de Viagem - Nordeste', '7 dias com hospedagem e café da manhã incluso', 3499.0, 10),
 (11, 'Smart TV 55"', 'Smart TV 4K com comando de voz e apps integrados', 2799.0, 1),
 (12, 'Tênis Esportivo', 'Tênis para corrida com amortecimento em gel', 349.9, 6),
 (13, 'Curso de Inglês Online', 'Aulas interativas e certificado incluído', 149.0, 5),
 (14, 'Serviço de Consultoria Financeira', 'Análise completa de finanças pessoais', 299.9, 7),
 (15, 'Mesa de Jantar 6 Lugares', 'Mesa em MDF com acabamento premium', 1899.0, 9),
 (16, 'Vestido Longo Floral', 'Vestido leve e ideal para o verão', 179.9, 3),
 (17, 'Notebook Gamer Pro', 'Máquina poderosa com RTX 4060 e 32GB RAM', 7999.0, 1),
 (18, 'Pacote de Viagem - Europa', 'Passagem + hospedagem em 3 países por 10 dias', 8999.0, 10),
 (19, 'Jaqueta Corta-Vento', 'Ideal para dias frios e chuvosos', 249.9, 3),
 (20, 'Curso de Marketing Digital', 'Aprenda estratégias de tráfego e SEO', 299.0, 5)]

- Funções de agregação

In [ ]:
%%sql
-- utilizando funções de agregação: SUM
select sum(preco) soma_total from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[(34870.09,)]

In [31]:
%%sql
-- utilizando funções de agregação: AVG
select avg(preco) media_valor from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[(1743.5044940948487,)]

In [30]:
%%sql
-- utilizando funções de agregação: MAX
select max(preco) maior_valor from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[(8999.0,)]

In [32]:
%%sql
-- utilizando funções de agregação: MIN
select min(preco) menor_valor from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[(0.0,)]

In [33]:
%%sql
-- utilizando funções de agregação: COUNT
select count(preco) quantidade from produtos;

 * postgresql://postgres:***@localhost:5432/banco
1 rows affected.

[(20,)]

In [35]:
%%sql
-- utilizando funções de agregação: GROUP BY
select 
    id_categoria, sum(preco) soma_por_cat 
    from produtos 
    group by id_categoria
    order by 1;

 * postgresql://postgres:***@localhost:5432/banco
9 rows affected.

[(1, 18196.9),
 (3, 489.69998),
 (4, 149.99),
 (5, 647.0),
 (6, 479.8),
 (7, 299.9),
 (8, 89.9),
 (9, 2018.9),
 (10, 12498.0)]

In [37]:
%%sql
-- utilizando funções de agregação: HAVING
select 
    id_categoria, sum(preco) soma_por_cat 
    from produtos 
    group by id_categoria
    having sum(preco) > 1000.0
    order by 2 desc;

 * postgresql://postgres:***@localhost:5432/banco
3 rows affected.

[(1, 18196.9), (10, 12498.0), (9, 2018.9)]

- JOIN's

In [ ]:
%%sql
-- utilizando funções de agregação: INNER JOIN
-- retorna todos os registros coincidentes nas duas tabelas
select 
    p.nome PRODUTO, c.nome CATEGORIA, p.preco PRECO
    from produtos p
    inner join categorias c on p.id_categoria = c.id_categoria;

 * postgresql://postgres:***@localhost:5432/banco
20 rows affected.

[('Notebook Ultrafino', 'Tecnologia', 4399.9),
 ('Smartphone X20', 'Tecnologia', 2999.0),
 ('Camiseta Estampada', 'Moda e Vestuário', 59.9),
 ('Suplemento Whey Protein', 'Saúde e Bem-Estar', 149.99),
 ('Curso de Python', 'Educação', 199.0),
 ('Bola de Futebol', 'Esportes e Lazer', 129.9),
 ('Conta Digital Plus', 'Serviços Financeiros', 0.0),
 ('Óleo de Motor Sintético', 'Automotivo', 89.9),
 ('Kit de Facas Inox', 'Casa e Decoração', 119.9),
 ('Pacote de Viagem - Nordeste', 'Turismo e Viagens', 3499.0),
 ('Smart TV 55"', 'Tecnologia', 2799.0),
 ('Tênis Esportivo', 'Esportes e Lazer', 349.9),
 ('Curso de Inglês Online', 'Educação', 149.0),
 ('Serviço de Consultoria Financeira', 'Serviços Financeiros', 299.9),
 ('Mesa de Jantar 6 Lugares', 'Casa e Decoração', 1899.0),
 ('Vestido Longo Floral', 'Moda e Vestuário', 179.9),
 ('Notebook Gamer Pro', 'Tecnologia', 7999.0),
 ('Pacote de Viagem - Europa', 'Turismo e Viagens', 8999.0),
 ('Jaqueta Corta-Vento', 'Moda e Vestuário', 249.9),
 ('Curso de Marketing Digital', 'Educação', 299.0)]

In [41]:
%%sql
delete from produtos where preco > 3000;

 * postgresql://postgres:***@localhost:5432/banco
4 rows affected.

[]

In [ ]:
%%sql
-- utilizando funções de agregação: LEFT JOIN
-- retorna todas os registros da direita, independente de existir na esquerda
select 
    p.nome PRODUTO, c.nome CATEGORIA, p.preco PRECO
    from categorias c
    left join produtos p on p.id_categoria = c.id_categoria;

 * postgresql://postgres:***@localhost:5432/banco
18 rows affected.

[('Smartphone X20', 'Tecnologia', 2999.0),
 ('Camiseta Estampada', 'Moda e Vestuário', 59.9),
 ('Suplemento Whey Protein', 'Saúde e Bem-Estar', 149.99),
 ('Curso de Python', 'Educação', 199.0),
 ('Bola de Futebol', 'Esportes e Lazer', 129.9),
 ('Conta Digital Plus', 'Serviços Financeiros', 0.0),
 ('Óleo de Motor Sintético', 'Automotivo', 89.9),
 ('Kit de Facas Inox', 'Casa e Decoração', 119.9),
 ('Smart TV 55"', 'Tecnologia', 2799.0),
 ('Tênis Esportivo', 'Esportes e Lazer', 349.9),
 ('Curso de Inglês Online', 'Educação', 149.0),
 ('Serviço de Consultoria Financeira', 'Serviços Financeiros', 299.9),
 ('Mesa de Jantar 6 Lugares', 'Casa e Decoração', 1899.0),
 ('Vestido Longo Floral', 'Moda e Vestuário', 179.9),
 ('Jaqueta Corta-Vento', 'Moda e Vestuário', 249.9),
 ('Curso de Marketing Digital', 'Educação', 299.0),
 (None, 'Turismo e Viagens', None),
 (None, 'Alimentos e Bebidas', None)]

In [45]:
%%sql
-- criando duas tabela para testes
drop table if exists a;
create table if not exists a (
    id serial primary key,
    tipo char(1),
    valor real
);

drop table if exists b;
create table if not exists b (
    id serial primary key,
    quantidade smallint not null,
    id_a smallint references a (id)
);

 * postgresql://postgres:***@localhost:5432/banco
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
insert into a (tipo, valor) values 
    ('a', 100.0), ('b', 200.0), ('c', 140.0), ('d', 120.0), ('e', 300.0),
    ('f', 170.0), ('g', 220.0), ('h', 110.0), ('i', 260.0), ('j', 190.0);

insert into b (quantidade, id_a) values 
    (2, 2), (5, 3), (3, 5), (5, 1), (1, 8), 
    (9, 3), (7, 4), (4, 8), (2, 1), (8, 5);

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[]

In [4]:
%sql select * from a;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[(1, 'a', 100.0),
 (2, 'b', 200.0),
 (3, 'c', 140.0),
 (4, 'd', 120.0),
 (5, 'e', 300.0),
 (6, 'f', 170.0),
 (7, 'g', 220.0),
 (8, 'h', 110.0),
 (9, 'i', 260.0),
 (10, 'j', 190.0)]

In [50]:
%%sql
select * from b;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[(1, 2, 2),
 (2, 5, 3),
 (3, 3, 5),
 (4, 5, 1),
 (5, 1, 8),
 (6, 9, 3),
 (7, 7, 4),
 (8, 4, 8),
 (9, 2, 1),
 (10, 8, 5)]

In [7]:
%%sql 
select 
    a.tipo, sum(a.valor * b.quantidade) total
    from a 
    inner join b on a.id = b.id_a
    group by 1
    order by 1;

 * postgresql://postgres:***@localhost:5432/banco
6 rows affected.

[('a', 700.0),
 ('b', 400.0),
 ('c', 1960.0),
 ('d', 840.0),
 ('e', 3300.0),
 ('h', 550.0)]

In [ ]:
%%sql
-- full outer join
select
    a.id, a.tipo, b.quantidade
    from a 
    full outer join b on a.id = b.id_a
    order by 1;

 * postgresql://postgres:***@localhost:5432/banco
14 rows affected.

[(1, 'a', 2),
 (1, 'a', 5),
 (2, 'b', 2),
 (3, 'c', 5),
 (3, 'c', 9),
 (4, 'd', 7),
 (5, 'e', 8),
 (5, 'e', 3),
 (6, 'f', None),
 (7, 'g', None),
 (8, 'h', 4),
 (8, 'h', 1),
 (9, 'i', None),
 (10, 'j', None)]

In [ ]:
%%sql
-- cross join
select
    a.id, a.tipo, b.quantidade
    from a 
    cross join b 
    order by 1
    limit 10;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[(1, 'a', 2),
 (1, 'a', 5),
 (1, 'a', 3),
 (1, 'a', 5),
 (1, 'a', 1),
 (1, 'a', 9),
 (1, 'a', 7),
 (1, 'a', 4),
 (1, 'a', 2),
 (1, 'a', 8)]

- Union

In [27]:
%%sql
select
    a.tipo
    from a inner join b on a.id = b.id_a
    group by 1
union
select
    a.tipo
    from a left join b on a.id = b.id_a
    where b.id is null
    group by 1
    order by 1;

 * postgresql://postgres:***@localhost:5432/banco
10 rows affected.

[('a',),
 ('b',),
 ('c',),
 ('d',),
 ('e',),
 ('f',),
 ('g',),
 ('h',),
 ('i',),
 ('j',)]